In [2]:
import pandas as pd
Country = pd.read_csv('country.csv')
Country

        Name  Population     Area     GDP Currency
0    Germany    82521653   357385  3466.0      EUR
1      Japan   126045000   377835  4938.0      YEN
2     Canada    36503097  9984670  1529.0      CAD
3      Italy    60501718   301338  1850.0      EUR
4   Brazilia   208360000  8515770  1798.0     REAL
5     Taiwan    23938272    36197   744.0      NTD
6  Venezuela    28208977   912050     NaN      VED

In [3]:
rslt_df = Country[Country['Population'] > 100000000]
rslt_df

       Name  Population     Area     GDP Currency
1     Japan   126045000   377835  4938.0      YEN
4  Brazilia   208360000  8515770  1798.0     REAL

In [4]:
record = {
  'Name': ['Ankit', 'Amit', 'Aishwarya', 'Priyanka', 'Priya', 'Shaurya' ],
  'Age': [21, 19, 20, 18, 17, 21],
  'Stream': ['Math', 'Commerce', 'Science', 'Math', 'Math', 'Science'],
  'Percentage': [88, 92, 95, 70, 65, 78]}
  
# create a dataframe
dataframe = pd.DataFrame(record, columns = ['Name', 'Age', 'Stream', 'Percentage'])
  
print("Given Dataframe :\n", dataframe) 
  
options = ['Math', 'Commerce']
  
# selecting rows based on condition
rslt_df = dataframe.loc[dataframe['Stream'].isin(options)]
  
print('\nResult dataframe :\n', rslt_df)

Given Dataframe :
         Name  Age    Stream  Percentage
0      Ankit   21      Math          88
1       Amit   19  Commerce          92
2  Aishwarya   20   Science          95
3   Priyanka   18      Math          70
4      Priya   17      Math          65
5    Shaurya   21   Science          78

Result dataframe :
        Name  Age    Stream  Percentage
0     Ankit   21      Math          88
1      Amit   19  Commerce          92
3  Priyanka   18      Math          70
4     Priya   17      Math          65

In [8]:
dataframe[dataframe['Name'].str.match('P')]

Empty DataFrame
Columns: [Name, Age, Stream, Percentage]
Index: []

In [10]:
dataframe[dataframe['Name'].str.contains('A',na=False, case=False)]

        Name  Age    Stream  Percentage
0      Ankit   21      Math          88
1       Amit   19  Commerce          92
2  Aishwarya   20   Science          95
3   Priyanka   18      Math          70
4      Priya   17      Math          65
5    Shaurya   21   Science          78

In [12]:
dataframe.sort_values('Percentage')

        Name  Age    Stream  Percentage
4      Priya   17      Math          65
3   Priyanka   18      Math          70
5    Shaurya   21   Science          78
0      Ankit   21      Math          88
1       Amit   19  Commerce          92
2  Aishwarya   20   Science          95

In [13]:
print(dataframe[dataframe['Age']>18])
print(dataframe.query('Age>18'))

        Name  Age    Stream  Percentage
0      Ankit   21      Math          88
1       Amit   19  Commerce          92
2  Aishwarya   20   Science          95
5    Shaurya   21   Science          78
        Name  Age    Stream  Percentage
0      Ankit   21      Math          88
1       Amit   19  Commerce          92
2  Aishwarya   20   Science          95
5    Shaurya   21   Science          78

In [14]:
dataframe['Percentage'].mean()

81.33333333333333

In [18]:
dataframe.describe()

             Age  Percentage
count   6.000000    6.000000
mean   19.333333   81.333333
std     1.632993   12.258331
min    17.000000   65.000000
25%    18.250000   72.000000
50%    19.500000   83.000000
75%    20.750000   91.000000
max    21.000000   95.000000